; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image1 - mode
	spectrograph2 - mode
	spectrograph3 - mode
	image0 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	Star2 - direction
	Star0 - direction
	GroundStation12 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	Star10 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation12)
	(supports instrument1 image1)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation12)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
)
(:goal (and
	(have_image Phenomenon13 spectrograph3)
	(have_image Planet14 spectrograph2)
	(have_image Planet15 image0)
	(have_image Star16 image0)
	(have_image Phenomenon17 image1)
))

)

; plan
1. (turn_to satellite1 groundstation3 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite1 phenomenon17 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 5
5. (take_image satellite1 phenomenon17 instrument2 image1)
   added: (have_image phenomenon17 image1)
   goals met: 1 of 5
6. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
7. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 1 of 5
8. (turn_to satellite0 phenomenon13 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 5
9. (take_image satellite0 phenomenon13 instrument1 spectrograph3)
   added: (have_image phenomenon13 spectrograph3)
   goals met: 2 of 5
10. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 2 of 5
11. (take_image satellite0 planet14 instrument1 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 3 of 5
12. (turn_to satellite1 planet15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet15)
   goals met: 3 of 5
13. (take_image satellite1 planet15 instrument2 image0)
   added: (have_image planet15 image0)
   goals met: 4 of 5
14. (turn_to satellite1 star16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star16)
   goals met: 4 of 5
15. (take_image satellite1 star16 instrument2 image0)
   added: (have_image star16 image0)
   goals met: 5 of 5
